[net]
batch=1
subdivisions=1
height=5
width=5
channels=3
momentum=0.9
decay=0.0005
max_crop=450

learning_rate=0.1
policy=poly
power=4
max_batches=16000000


[convolutional]
batch_normalize=0
filters=3
size=3
stride=1
pad=1
activation=relu


[depthwise_convolutional]
batch_normalize=0
size=3
stride=1
pad=0
activation=relu


[avgpool]

[softmax]
groups=1

[cost]
type=sse